class YandexSamokatHomePageFAQ:
    answer1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YandexSamokatOrderPageData:
    data_config = {
        'data_config_1': {
            'name': 'Екатерина',
            'last_name': 'Неясная',
            'address': 'улица Десяти перекрестков',
            'subway_name': 'Чистые пруды',
            'telepthone_number': '89138082345',
            'date': '28.10.2024',
            'rental_period': 0,
            'color': [0],
            'comment_for_courier': 'Нужно позвонить для быстрой коммуникации',
            'description': 'Корректные данные'
        },
        'data_config_2':
            {'name': 'Павел',
             'last_name': 'Ясный',
             'address': 'улица Одного поворота',
             'subway_name': 'Новокосино',
             'telepthone_number': '89050501020',
             'date': '29.09.2024',
             'rental_period': 1,
             'color': [0, 1],
             'comment_for_courier': 'Ну, как пойдет',
             'description': 'Корректные данные'
             },
    }